<?php

declare(strict_types=1);

namespace Dujana\ArabicNlp\Enums;

enum VerbFormEnum: string
{
    /*
    |--------------------------------------------------------------------------
    | Triliteral / Form I - الثلاثي المجرد
    |--------------------------------------------------------------------------
    */

    case TriliteralBarePast = 'triliteral_bare_past'; // فعل
    case TriliteralPresent = 'triliteral_present'; // يفعل

    /*
    |--------------------------------------------------------------------------
    | Quadriliteral - الرباعي
    |--------------------------------------------------------------------------
    */

    case QuadriliteralBarePast = 'quadriliteral_bare_past'; // فعلل
    case QuadriliteralPresent = 'quadriliteral_present'; // يفعلل
    case Tafaallala = 'tafaallala'; // تفعلل

    /*
    |--------------------------------------------------------------------------
    | Form II - فعّل
    |--------------------------------------------------------------------------
    */

    case Fa33ala = 'fa33ala'; // فعّل
    case Fa33alaPresent = 'fa33ala_present'; // يفعّل

    /*
    |--------------------------------------------------------------------------
    | Form III - فاعل
    |--------------------------------------------------------------------------
    */

    case Faaala = 'faaala'; // فاعل
    case FaaalaPresent = 'faaala_present'; // يفاعل

    /*
    |--------------------------------------------------------------------------
    | Form IV - أفعل
    |--------------------------------------------------------------------------
    */

    case Afala = 'afala'; // أفعل
    case AfalaPresent = 'afala_present'; // يفعل

    /*
    |--------------------------------------------------------------------------
    | Form V - تفعّل
    |--------------------------------------------------------------------------
    */

    case Tafaala = 'tafaala'; // تفعّل
    case TafaalaPresent = 'tafaala_present'; // يتفعّل

    /*
    |--------------------------------------------------------------------------
    | Form VI - تفاعل
    |--------------------------------------------------------------------------
    */

    case Tafaaala = 'tafaaala'; // تفاعل
    case TafaaalaPresent = 'tafaaala_present'; // يتفاعل

    /*
    |--------------------------------------------------------------------------
    | Form VII - انفعل
    |--------------------------------------------------------------------------
    */

    case Infaala = 'infaala'; // انفعل
    case InfaalaPresent = 'infaala_present'; // ينفعل

    /*
    |--------------------------------------------------------------------------
    | Form VIII - افتعل
    |--------------------------------------------------------------------------
    */

    case Iftaala = 'iftaala'; // افتعل
    case IftaalaPresent = 'iftaala_present'; // يفتعل
    case IftaalaAssimilated = 'iftaala_assimilated'; // اصطبر، اضطرب، اتصل
    case IftaalaAssimilatedPresent = 'iftaala_assimilated_present'; // يصطبر، يضطرب، يتصل

    /*
    |--------------------------------------------------------------------------
    | Form IX - افعلّ
    |--------------------------------------------------------------------------
    */

    case Ifalla = 'ifalla'; // افعلّ
    case IfallaPresent = 'ifalla_present'; // يفعلّ

    /*
    |--------------------------------------------------------------------------
    | Form X - استفعل
    |--------------------------------------------------------------------------
    */

    case Istafala = 'istafala'; // استفعل
    case IstafalaPresent = 'istafala_present'; // يستفعل

    /*
    |--------------------------------------------------------------------------
    | Diagnostic / Ambiguous
    |--------------------------------------------------------------------------
    */

    case AmbiguousVerbPattern = 'ambiguous_verb_pattern';
}
